## Введение
Цель: Глоссарий содержит описания терминов, используемых при проектировании сервиса по управлению и учету достижений сотрудников компаний. Определяются основные понятия, непосредственно связанные с использованием приложения.
Контекст:
Глоссарий создан в рамках проекта разработки сервиса.

Определения
Понятия, используемые при взаимодействии с приложением.

Показатель - Действие, которое необходимо выполнить для участия в событии (Например: закрыть задачу, протестировать баг)
Действие показателя - Время, на период которого распространяется показатель (Показатель может быть неограниченным во времени, а может действовать только на протяжении одного месяца).
Правило - Количество необходимое для показателя, при достижении которого, может быть получено достижение. 
Событие - Показатель, выполненный пользователем хотя бы 1 раз.
Участие в событии - Выполнение действия события хотя бы 1 раз (Например: пользователь закрыл задачу, а значит учавствует в событии)
Достижение - Совокупность событий и показателей (Например: пользователь авторизировался (событие) + создал задачу 10 раз (показатель + правило), поэтому получается достижение)
Индекс пользователя - Количество выполненых достижений из всех возможных.
Рейтинг - Порядковый номер пользователя среди всех сотрудников, основанный на индексе.



